#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.BinhMinhIdCardAPI.cloudflare_record.bmidcard_api: Refreshing state... [id=6e9cfbacb5fa5c433735b7be41fee631]
module.LuaLepAPI.cloudflare_record.lualep: Refreshing state... [id=d9e619af5ed3a3229b73c1179bd37a77]
module.TestReady.heroku_app.testready: Refreshing state... [id=testready-megatunger]
module.LuaLepAPI.heroku_app.lualep: Refreshing state... [id=lua-lep-api]
module.BinhMinhIdCardAPI.heroku_app.bmidcard_api: Refreshing state... [id=binhminh-idcard-api]
module.TestReady.cloudflare_record.www_testready: Refreshing state... [id=f6c9a4e7941a8e864238a3cceadd1cef]
module.TestReady.cloudflare_record.testready: Refreshing state... [id=633b4e558148faceea66d6e1d5880876]
module.BinhMinhIdCardAPI.heroku_build.bmidcard_api: Refreshing state... [id=ecb8f54e-69c9-4342-b1d8-e6c6d03f0796]
module.LuaLepAPI.heroku_build.lualep: Refreshing state... [id=8f168cb6-c51e-4f6a-a8d0-2594681b7c16]
module.TestReady.heroku_domain.testready: Refreshing state... [id=85ace6e0-3c7a-4691-a997-ca35e1960b1b]
module.TestReady.heroku_addon.redis: Refreshing state... [id=36d41931-c9a0-4941-89b3-2a1e085d695a]
module.TestReady.heroku_domain.www_testready: Refreshing state... [id=20b6df00-695c-49e6-9006-555e5a42b3d3]
module.TestReady.heroku_addon.database: Refreshing state... [id=3a3dfb0f-7372-439c-9263-4906fbd57f43]
module.TestReady.heroku_build.testready: Refreshing state... [id=7f8dabbc-8eba-4464-b65d-f31f0fa43c9c]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.GithubPages.cloudflare_record.megatunger will be created
  + resource "cloudflare_record" "megatunger" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "@"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "megatunger.github.io"
      + zone_id     = "0783d89a07c4a168916840cd39a8bc00"
    }

  # module.GithubPages.cloudflare_record.www_megatunger will be created
  + resource "cloudflare_record" "www_megatunger" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "megatunger.github.io"
      + zone_id     = "0783d89a07c4a168916840cd39a8bc00"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @megatunger, Action: `pull_request`*